abusaidm.html-snippets
batisteo.vscode-django
bradlc.vscode-tailwindcss
brian-crant.python-logger-vscode
burkeholland.simple-react-snippets
caolin.java-run
christian-kohler.npm-intellisense
cweijan.dbclient-jdbc
cweijan.vscode-mysql-client2
davidmorais.dark-magic-themes
docker.docker
docsmsft.docs-markdown
docsmsft.docs-preview
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dsznajder.es7-react-js-snippets
dzhavat.bracket-pair-toggler
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
formulahendry.code-runner
franneck94.c-cpp-runner
github.codespaces
github.copilot
github.copilot-chat
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
kevinrose.vsc-python-indent
lakshits11.best-themes-redefined
lakshits11.monokai-pirokai
lintangwisesa.arduino
miguelsolorio.fluent-icons
miguelsolorio.symbols
mongodb.mongodb-vscode
ms-azuretools.vscode-azure-github-copilot
ms-azuretools.vscode-azure-mcp-server
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.azure-repos
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.js-debug-nightly
ms-vscode.remote-repositories
njpwerner.autodocstring
pkief.material-icon-theme
reactreedev.reactree
redhat.java
ritwickdey.liveserver
styled-components.vscode-styled-components
tonybaloney.vscode-pets
twxs.cmake
vadimcn.vscode-lldb
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.migrate-java-to-azure
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-java-upgrade
vscjava.vscode-maven
vscode-icons-team.vscode-icons
wholroyd.jinja
woodreamz.es7-react-js-snippets
xabikos.javascriptsnippets
zainchen.json
